     A*%%TS  SD  20210909  053012  AAKASH      REL-V7R4M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      INDARA
     A          R A_HSCR
     A*%%TS  SD  20210909  053012  AAKASH      REL-V7R4M0  5770-WDS
     A                                      CA03(03 'Exit')
     A                                      CA12(12 'Back')
     A                                  1 34'PROGRAMMERS.IO'
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  1  2'Welcome'
     A                                      COLOR(WHT)
     A                                  1 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  2 72TIME
     A                                      COLOR(BLU)
     A                                 23  2'F3 = Exit'
     A                                      COLOR(BLU)
     A                                 23 15'F12 = Back'
     A                                      COLOR(BLU)
     A                                 20  2'Parameter or Command'
     A                                      COLOR(BLU)
     A                                 21  2'===>'
     A                                      COLOR(WHT)
     A            ACOM_LINE     70A  B 21  8
     A                                  3 27'Insurance Management System'
     A                                      DSPATR(RI)
     A                                      COLOR(WHT)
     A                                  5 32'Agent Home Screen'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A            D_AUSR        15A  O  2  2
     A                                  1 11'Agent'
     A                                      COLOR(WHT)
     A                                  8  2'1.'
     A                                      COLOR(WHT)
     A                                  9  2'2.'
     A                                      COLOR(WHT)
     A                                 10  2'3.'
     A                                      COLOR(WHT)
     A                                 11  2'4.'
     A                                      COLOR(WHT)
     A                                 12  2'5.'
     A                                      COLOR(WHT)
     A                                 13  2'6.'
     A                                      COLOR(WHT)
     A                                  8  5'View Customer/New Registration'
     A                                  9  5'View Policy Details'
     A                                 10  5'View Commission'
     A                                 11  5'View/Update Policy Laps'
     A                                 12  5'View/Raise Request'
     A                                 13  5'Sign OFF'
     A            A_ERRMSG      70A  O 24  3COLOR(WHT)
     A          R A_C_SFL                   SFL
     A*%%TS  SD  20210903  063313  AAKASH      REL-V7R4M0  5770-WDS
     A            A_OPT1         1S 0I 12  2
     A            CUST_ID   R        O 12  9REFFLD(CUST_REC/CUST_ID AAKASH/CUST-
     A                                      _MAST)
     A            CUST_NAME R        O 12 20REFFLD(CUST_REC/CUST_NAME AAKASH/CU-
     A                                      ST_MAST)
     A            C_CITY    R        O 12 38REFFLD(CUST_REC/C_CITY AAKASH/CUST_-
     A                                      MAST)
     A            C_DOJ     R        O 12 63REFFLD(CUST_REC/C_DOJ AAKASH/CUST_M-
     A                                      AST)
     A          R A_C_CTL                   SFLCTL(A_C_SFL)
     A*%%TS  SD  20210906  042950  AAKASH      REL-V7R4M0  5770-WDS
     A                                      SFLSIZ(9999)
     A                                      SFLPAG(0008)
     A                                      CA03(03 'Exit')
     A                                      CA12(12 'back')
     A                                      OVERLAY
     A  41                                  SFLDSP
     A  42                                  SFLDSPCTL
     A  43                                  SFLCLR
     A  44                                  SFLEND(*MORE)
     A                                  1 34'PROGRAMMERS.IO'
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  1  2'WELCOME AGENT'
     A                                      COLOR(WHT)
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  2 73TIME
     A                                      COLOR(BLU)
     A                                  3 27'INSURANCE MANAGEMENT SYSTEM'
     A                                      DSPATR(RI)
     A                                      COLOR(WHT)
     A            D_AUSR        15A  O  2  2
     A                                  5 33'Customer Details'
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  7  2'Type Option,Press Enter'
     A                                      COLOR(BLU)
     A                                  8  2'2 = Update Request   4 = Delete Re-
     A                                      quest    5 = Display'
     A                                      COLOR(BLU)
     A                                  9  2'6 = Add Policy to Customer'
     A                                      COLOR(BLU)
     A                                 11  7'Customer ID'
     A                                      COLOR(WHT)
     A                                 11 20'Customer Name'
     A                                      COLOR(WHT)
     A                                 11  2'Opt'
     A                                      COLOR(WHT)
     A                                 11 56'Customer Date Of Joining'
     A                                      COLOR(WHT)
     A                                 11 38'Customer City'
     A                                      COLOR(WHT)
     A          R FOOTER
     A*%%TS  SD  20210901  081647  AAKASH      REL-V7R4M0  5770-WDS
     A                                 22  2'F3 = Exit'
     A                                      COLOR(BLU)
     A                                 22 18'F12 = Back'
     A                                      COLOR(BLU)
     A          R A_ADDCUST
     A*%%TS  SD  20210902  065404  AAKASH      REL-V7R4M0  5770-WDS
     A                                  1 34'PROGRAMMERS.IO'
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A          R A_POLSFL                  SFL
     A*%%TS  SD  20210908  062851  AAKASH      REL-V7R4M0  5770-WDS
     A            A_POPT         1S 0B 11  2COLOR(WHT)
     A            POL_ID    R        O 11  9REFFLD(P_REC/POL_ID AAKASH/POLICY_D-
     A                                      TL)
     A            P_ENTTRM  R        O 11 50REFFLD(P_REC/P_ENTTRM AAKASH/POLICY-
     A                                      _DTL)
     A            POL_NAME  R        O 11 19REFFLD(P_REC/POL_NAME AAKASH/POLICY-
     A                                      _DTL)
     A            P_PLNTYP  R        O 11 63REFFLD(P_REC/P_PLNTYP AAKASH/POLICY-
     A                                      _DTL)
     A            P_TERM    R        O 11 36REFFLD(P_REC/P_TERM AAKASH/POLICY_D-
     A                                      TL)
     A          R A_POLCTL                  SFLCTL(A_POLSFL)
     A*%%TS  SD  20210908  070552  AAKASH      REL-V7R4M0  5770-WDS
     A                                      CA03(03 'Exit')
     A                                      CA12(12 'Back')
     A                                      OVERLAY
     A  41                                  SFLDSP
     A  42                                  SFLDSPCTL
     A  43                                  SFLCLR
     A  44                                  SFLEND(*MORE)
     A                                      SFLSIZ(9999)
     A                                      SFLPAG(0008)
     A                                  1  2'Welcome Agent'
     A                                      COLOR(WHT)
     A            D_AUSR        15A  O  2  2
     A                                  1 34'PROGRAMMERS.IO'
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  2 73TIME
     A                                      COLOR(BLU)
     A                                  3 27'Insurance Management System'
     A                                      COLOR(WHT)
     A                                      DSPATR(RI)
     A                                  7  2'Type Option,Press Enter'
     A                                      COLOR(BLU)
     A                                  8  3'5 = Display'
     A                                      COLOR(BLU)
     A                                  5 34'Policy Details'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A                                 10  2'Opt'
     A                                      COLOR(WHT)
     A                                 10  7'Policy ID'
     A                                      COLOR(WHT)
     A                                 10 19'Policy Name'
     A                                      COLOR(WHT)
     A                                 10 36'Policy Term'
     A                                      COLOR(WHT)
     A                                 10 50'Entry Age'
     A                                      COLOR(WHT)
     A                                 10 63'Plan Type'
     A                                      COLOR(WHT)
     A          R D_APOLDTL
     A*%%TS  SD  20210908  070552  AAKASH      REL-V7R4M0  5770-WDS
     A                                      CA03(03 'Exit')
     A                                      CA12(12 'Back')
     A                                  1  2'Welcome Agent'
     A                                      COLOR(WHT)
     A                                  1 34'PROGRAMMERS.IO'
     A                                      COLOR(BLU)
     A                                      DSPATR(RI)
     A                                  1 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  2 72TIME
     A                                      COLOR(BLU)
     A                                  3 27'Insurance Management System'
     A                                      COLOR(WHT)
     A                                      DSPATR(RI)
     A                                  5 34'Policy Details'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A                                  8  2'Policy ID.........:'
     A                                      COLOR(WHT)
     A                                  9  2'Policy Name.......:'
     A                                      COLOR(WHT)
     A                                 10  2'Policy Term.......:'
     A                                      COLOR(WHT)
     A                                 10 79'_'
     A                                 11  2'Entry Age.........:'
     A                                      COLOR(WHT)
     A                                 12  2'Policy Plan Type..:'
     A                                      COLOR(WHT)
     A                                 14  2'Policy Status.....:'
     A                                      COLOR(WHT)
     A                                 15  2'Sum Assured.......:'
     A                                      COLOR(WHT)
     A            POL_ID    R        O  8 27REFFLD(P_REC/POL_ID AAKASH/POLICY_D-
     A                                      TL)
     A            POL_NAME  R        O  9 27REFFLD(P_REC/POL_NAME AAKASH/POLICY-
     A                                      _DTL)
     A            P_TERM    R        O 10 27REFFLD(P_REC/P_TERM AAKASH/POLICY_D-
     A                                      TL)
     A            P_ENTTRM  R        O 11 27REFFLD(P_REC/P_ENTTRM AAKASH/POLICY-
     A                                      _DTL)
     A            P_PLNTYP  R        O 12 27REFFLD(P_REC/P_PLNTYP AAKASH/POLICY-
     A                                      _DTL)
     A            P_STATUS  R        O 14 27REFFLD(P_REC/P_STATUS AAKASH/POLICY-
     A                                      _DTL)
     A            P_SUMASSU R        O 15 27REFFLD(P_REC/P_SUMASSU AAKASH/POLIC-
     A                                      Y_DTL)
     A            P_PREMIUM R        O 13 27REFFLD(P_REC/P_PREMIUM AAKASH/POLIC-
     A                                      Y_DTL)
     A                                 13  2'Policy Premium....:'
     A                                      COLOR(WHT)
     A                                 23  2'F3=Exit'
     A                                      COLOR(BLU)
     A                                 23 13'F12=Back'
     A                                      COLOR(BLU)
     A            D_AUSR        15A  O  2  2
     A          R A_COMMSFL                 SFL
     A*%%TS  SD  20210909  051408  AAKASH      REL-V7R4M0  5770-WDS
     A            FLD001         1  0B 10  2
     A          R A_COMMCTL                 SFLCTL(A_COMMSFL)
     A*%%TS  SD  20210909  051408  AAKASH      REL-V7R4M0  5770-WDS
     A                                      CA03(03 'Exit')
     A                                      CA12(12 'Back')
     A                                      OVERLAY
     A  41                                  SFLDSP
     A  42                                  SFLDSPCTL
     A  43                                  SFLCLR
     A  44                                  SFLEND(*MORE)
     A                                      SFLSIZ(9999)
     A                                      SFLPAG(0008)
     A                                  1  2'Welcome Agent'
     A                                      COLOR(WHT)
     A            D_AUSR        15   O  2  2
     A                                  1 34'PROGRAMMERS.IO'
     A                                      COLOR(BLU)
     A                                      DSPATR(RI)
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  2 73TIME
     A                                      COLOR(BLU)
     A                                  3 27'Insurance Management System'
     A                                      COLOR(WHT)
     A                                      DSPATR(RI)
     A                                  5 33'View Commission'
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A                                  6  2'Type Option, Press Enter'
     A                                      COLOR(BLU)
     A                                  7  4'5=Display'
     A                                      COLOR(BLU)
     A                                  9  2'Opt'
     A                                      COLOR(WHT)
     A                                  9  8'Policy ID'
     A                                      COLOR(WHT)
     A                                  9 20'Policy Name'
     A                                      COLOR(WHT)
     A                                  9 35'Customer Name'
     A                                      COLOR(WHT)
     A                                  9 54'Time period'
     A                                      COLOR(WHT)
     A                                  9 68'Commission'
     A                                      COLOR(WHT)
